Загалом курсс чудово продовжує шлях попереднього і базується на його функдації.
Найскладнішим для мене було інтуїтивно зрозуміти SHAP значення — не просто 
як їх порахувати, а саме відчути чому передбачення для одного конкретного пацієнта відрізняється 
від середнього по всіх даних. ю Також довше вдуплявся коли краще використовувати PDP, а коли permutation 
importance чи SHAP, бо на перший погляд вони роблять те саме.

з непотрібнрого не дуже бачу що виділити. ну надмірна демонстрація на мою думку завжди окей бо є можливість копатися серед порівнянь.
тому велика купа графіків тільки в плюс
